# Создайте модуль с функцией внутри.
# � Функция получает на вход загадку, список с
# возможными вариантами отгадок и количество
# попыток на угадывание.
# � Программа возвращает номер попытки, с которой
# была отгадана загадка или ноль, если попытки
# исчерпаны.
from modul_guess import my_game, show_results

print(my_game(2))
print(show_results())